import { CardI } from "@/interfaces/CeCardI";

export const overviewCards: CardI[] = [
    { title: 'الحياة الثقافية اليومية', description: 'تعرف على الروتين اليومي، والبنية الاجتماعية، ونمط حياة اليونانيين القدماء.' },
    { title: 'الفنون والموسيقى', description: 'اكتشف التراث الفني والموسيقي الغني لليونان القديمة، بما في ذلك النحت واللوحات والآلات الموسيقية.' },
    { title: 'المسرح', description: 'جرب أصول الدراما والعروض المسرحية التي شكلت فن رواية القصص لقرون.' },
    { title: 'المهرجانات والترفيه العام', description: 'استكشف المهرجانات النابضة بالحياة والعروض العامة التي كانت محور الحياة المجتمعية في اليونان القديمة.' }
];