import { CardI } from "@/interfaces/CeCardI";

export const ExploreMoreCards: CardI[] = [
    { title: '🎨 الثقافة', description: 'تعرّف على العادات والتقاليد والحياة الثقافية في اليونان.', href: '/cultureEntertainment/culture' },
    { title: '⚡ الأساطير', description: 'اكتشف عالم الآلهة والأبطال والأساطير اليونانية.', href: '/cultureEntertainment/mythology' },
    { title: '✈️ السياحة', description: 'استمتع بأشهر المعالم والتجارب السياحية في اليونان.', href: '/cultureEntertainment/tourism' },
    { title: '🏺 التاريخ', description: 'رحلة عبر العصور المختلفة للحضارة اليونانية.', href: '/history' },
    { title: '📍 الوجهات', description: 'تعرّف على أهم المدن والجزر اليونانية.', href: '/commercial' },
    { title: '🖼️ المعالم', description: 'اكتشف أشهر المعالم التاريخية مثل المعابد، المسارح، والمدن الأثرية.', href: '/#places' }
];