import { FAQItem } from "@/interfaces/FAQs";

export const faqs: FAQItem[] = [
    { question: "ما هي اليونان؟", answer: "اليونان هي دولة تقع في جنوب شرق أوروبا وتشتهر بتاريخها الغني والحضارة القديمة." },
    { question: "ما عاصمة اليونان؟", answer: "أثينا هي عاصمة اليونان وأكبر مدنها." },
    { question: "ما هي اللغة الرسمية؟", answer: "اللغة الرسمية هي اليونانية." },
    { question: "ما هو الدين السائد؟", answer: "الدين السائد في اليونان هو المسيحية الأرثوذكسية اليونانية." },
    { question: "ما أشهر المعالم السياحية في اليونان؟", answer: "الأكروبوليس في أثينا، جزر سانتوريني، ميكونوس، دلفي." },
    { question: "ما هي العملة الرسمية؟", answer: "اليورو (€) هي العملة الرسمية في اليونان." },
    { question: "ما هو المناخ في اليونان؟", answer: "مناخ البحر الأبيض المتوسط، صيف حار وجاف، وشتاء معتدل ورطب." },
    { question: "ما أشهر المأكولات اليونانية؟", answer: "موساكا، سوفلاكي، تزيatziki، جيروس." },
    { question: "ما أشهر الأحداث التاريخية؟", answer: "الحضارة اليونانية القديمة، الألعاب الأولمبية القديمة، الإمبراطورية البيزنطية." },
    { question: "ما أشهر الفلاسفة اليونانيين؟", answer: "أفلاطون، أرسطو، سقراط، فيثاغورس." },
    { question: "ما أهم الصناعات؟", answer: "السياحة، الشحن البحري، الزراعة، الصناعات الغذائية." },
    { question: "ما أشهر الشخصيات التاريخية؟", answer: "الإسكندر الأكبر، بيرسيوس، فيليب الثاني، سولون." },
];