import { HomeLandmark } from "@/interfaces/HomeLandmarksI";

export const landmarks:HomeLandmark[] = [
    {
        image: "/Acropolis.avif",
        title: "Acropolis",
        description:
            "كانت الأكروبوليس عبارة عن مستوطنة في الجزء العلوي من مدينة يونانية قديمة، وخاصة القلعة، وغالبًا ما كانت عبارة عن تل ذي جوانب شديدة الانحدار، يتم اختياره أساسًا لأغراض الدفاع، وتضم أشهر المعابد مثل معبد البارثينون.",
        rowSpan: 2,
        height: "h-96",
    },
    {
        image: "/Athens.avif",
        title: "Athens",
        description:
            "أثينا هي عاصمة اليونان وأكبر مدنها، وتُعد مهد الحضارة الغربية والديمقراطية. لعبت دورًا محوريًا في تطور الفلسفة، والفنون، والعلوم، ولا تزال حتى اليوم مركزًا ثقافيًا وتاريخيًا مهمًا.",
    },
    {
        image: "/Chania.avif",
        title: "Chania",
        description:
            "خانيا، التي تُكتب أحيانًا باللاتينية هانيا، هي مدينة ساحلية جميلة تقع في شمال غرب جزيرة كريت. تتميز بمينائها الفينيسي القديم، وتاريخها المتنوع الذي يجمع بين الحضارات اليونانية والرومانية والعثمانية.",
    },
    {
        image: "/Delphi.avif",
        title: "Delphi",
        description:
            "دلفي، التي كانت تُعرف في الأساطير باسم بيثو، هي موقع أثري مقدس في وسط اليونان. كانت مقر عرافة دلفي الشهيرة، حيث كان الناس من مختلف أنحاء العالم الإغريقي يأتون طلبًا للنبوءات والمشورة.",
    },
    {
        image: "/Rhodes.avif",
        title: "Rhodes",
        description:
            "رودس هي واحدة من أشهر الجزر اليونانية، وتقع في بحر إيجة. اشتهرت قديمًا بتمثال رودس العملاق، أحد عجائب الدنيا السبع، وتتميز اليوم بمدينتها القديمة المحصنة وشواطئها الخلابة.",
    },
];