import { HomeBestPlaces } from "@/interfaces/HomeBestPlaces";

export const places:HomeBestPlaces[] = [
    {
        id: "acropolisMuseum",
        name: "متحف الأكروبوليس",
        city: "أثينا",
        image: "/Acropolis Museum.avif",
        rating: 9.7,
        price: 12,
        link: "/places/acropolisMuseum",
        desk: `متحف أكروبوليس الجديد (باليونانية:Νέο Μουσείο Ακροπόλεως). تم بنائه في العام 2007 وهو من تصميم المعماري برنارد تشومي لعرض اللآثار والمنحوتات التي تم العثور عليها في أكروبوليس أثينا في أثينا باليونان. تم الانتهاء منه في 2008 وتم تدشينه في 2009.

المتحف يقع في شارع ديونيسوس أريوباغيتو على منحدر جنوب غربي هضبة الأكروبوليس. ويحاكي تصميم طابقه الأعلى معبد بارثينون، وقبل بناء المتحف ثار جدل بشأن بناء مبنى ضخم حديث في موقع أثري.`
    },
    {
        id: "santoriniCaldera",
        name: "سانتوريني كالديرا",
        city: "سانتوريني",
        image: "/Santorini.avif",
        rating: 9.5,
        price: 20,
        link: "/places/santoriniCaldera",
        desk: `كلديرا سانتوريني هي كلديرا كبيرة تقع في جنوب بحر إيجة، على بعد 120 كيلومتر إلى الشمال من جزيرة كريت في اليونان، تتكون من سانتوريني (أكا ثيرا) وهي الجزيرة الرئيسية، وتيريزيا وأسبرونسي على الحافة الخارجية، وجزر كاميني في المنتصف.`
    },
    {
        id: "delphi",
        name: "مدينة دلفي الأثرية",
        city: "دلفي",
        image: "/Delphi.avif",
        rating: 9.3,
        price: 8,
        link: "/places/delphi",
        desk: `ديلفوي (Δελφοί) هي مدينة في فوكيس في مقاطعة كينتريكي إلادا في اليونان. تحوي المدينة أهم المنتجعات الأثرية والمراكز الثقافية التي شكلت نبراس المعتقدات الدينية لليونانيين القدماء في عالم الكلاسيكي القديم، ويبلغ عدد سكانها حوالي 3,511 نسمة حسب تعداد 2001.

وفقًا لموسوعة سودا، اشتقت ديلفي اسمها من أفعى دالفاين، أنثى الثعبان (دراكينا) التي عاشت هناك وقتلها الإله الإغريقي أبولو (في رواياتٍ أخرى كانت الأفعى هي الثعبان الذكر (دراكون) بايثون).

يحتل هذا المكان المقدس منطقة محددة على المنحدر الجنوبي الغربي لجبل بارناسوس.

تمثل المنطقة اليوم موقعًا أثريًّا واسع النطاق، وباتت جزءًا من منتزه بارناسوس الوطني منذ عام 1938. أدرجتها منظمة اليونسكو كموقعٍ أثري ضمن لائحة التراث العالمي نظرًا لتأثيرها الكبير في العالم القديم، ويتضح ذلك من خلال الآثار المختلفة التي بنتها معظم الدول-المدن اليونانية القديمة المهمة، ما يدل على وحدتها اليونانية الأساسية.

تجاور بلدة صغيرة حديثة المنطقة المقدسة هذه وتحمل الاسم ذاته.`
    },
    {
        id: "knossos",
        name: "كنوسوس",
        city: "كريت",
        image: "/Knossos.avif",
        rating: 9.1,
        price: 15,
        link: "/places/knossos",
        desk: `كنوسوس (باليونانية: Κνωσός) هي مدينة ملكية قديمة تقع في شمال إقريطش (كريت) بالقرب من كاندية (إراكلو)، ازدهرت فيها الثقافة في العصر البرونزي بين عامي 2000 و 1400 قبل الميلاد. وهي موقع متاهة دايدالوس الأسطورية وقصر الملك مينوس. كانت عاصمة الملك مينوس ومركز الحضارة المينوسية. في الألفية السابعة قبل الميلاد استقر فيها مهاجرون من الأناضول مما أدى لازدهارها في ذلك الوقت.

بني فيها قصران رئيسيان في الفترة المينوسية الوسطى وفي حوالي العام 1720 قبل الميلاد بعد حدوث زلزال في المدينة. في عام 1580 قبل الميلاد تقريباً بدأت الحضارة المينوسية بالامتداد لكامل اليونان حيث أثرت تأثيرًا كبيرًا على حضارة ميكناي. في عام 1400 قبل الميلاد دمر قصرها بواسطة النار، ففقدت المدينة بعضاً من أهميتها السياسية، فتحول المركز السياسي الأيجي إلى مدينة ميكناي.`
    },
    {
        id: "rhodesOldtown",
        name: "مدينة رودس القديمة",
        city: "رودس",
        image: "/Rhodes.avif",
        rating: 9.4,
        price: 10,
        link: "/places/rhodesOldtown",
        desk: `رودس مدينة يونانية تقع في جنوب شرق اليونان ضمن جزيرة رودس، وتتبع إداريًا منطقة جنوب إيجة وتُعد مركز مقاطعة الدوديكانيز. تتميز المدينة بتاريخها العريق ومعالمها الشهيرة، أبرزها ميناء مانذراكي الذي كان موقع تمثال كولوسوس رودس إحدى عجائب الدنيا السبع، ومدينة رودس القروسطية المصنفة ضمن مواقع التراث العالمي لليونسكو لما تضمه من آثار بيزنطية وصليبية وعثمانية، إضافة إلى قصر المعلم الأكبر، جامع سليمان، بوابة أمبواز، وأكروبوليس رودس. كما تُعد رودس مدينة حيوية تضم أندية رياضية، قنصليات لعدة دول، ميناءً يربطها بالموانئ اليونانية، ومطار دياغوراس الدولي، إلى جانب وجود بعض أقسام الجامعة الإيجية.`
    },
];