import { HistoryDatasI } from "@/interfaces/HistoryDatasI";
import {Calendar, MapPin, Crown, Users, DollarSign, BookOpen, Image, Edit3, AlertCircle, Zap } from "lucide-react";

export const minoanData:HistoryDatasI = {
    title: "الحضارة المينوسية",
    period: { icon: Calendar, text: "3000 – 1450 ق.م" },
    location: { icon: MapPin, text: "جزيرة كريت" },
    origin: { icon: Zap, text: "أقدم حضارة متقدمة في اليونان وأوروبا، نشأت بسبب موقع كريت البحري الاستراتيجي الذي ساعد على التجارة والسيطرة على بحر إيجة، وكانت مركزًا حضاريًا مزدهرًا ومتقدمًا في الهندسة والفنون." },
    politics: { icon: Crown, text: "نظام حكم مركزي حول القصور الملكية، الحكم كان غالبًا ملكيًا أو زعيمًا دينيًا. لم تعتمد على الجيوش أو الأسوار، مما يعكس طبيعة مجتمع سلمية نسبيًا. القصور كانت مراكز إدارية ودينية واقتصادية." },
    society: { icon: Users, text: "مجتمع مستقر وسلمي، مع دور بارز للمرأة في الدين والفن. المهن متخصصة: حرفيون، تجار، صيادون، ومزارعون. المجتمع يشجع التعاون بين الطبقات ويظهر فيه احترام للفنون والحرف اليدوية." },
    economy: { icon: DollarSign, text: "اقتصاد متنوع يعتمد على التجارة البحرية مع مصر، الشام، وآسيا الصغرى، صادرات: الزيت، الفخار، المعادن، منتجات الفواكه، والمنتجات البحرية، واستيراد الذهب، الفضة، والأخشاب النادرة. تطورت أنظمة التخزين والنقل." },
    religion_culture: { icon: BookOpen, text: "عبادة الطبيعة، رمزية الثور المقدس، طقوس دينية مرتبطة بالكهوف والجبال، مهرجانات دينية وفنية، عبادات خاصة بالخصوبة والبحر، تأثير قوي على الأساطير اليونانية لاحقًا." },
    art_architecture: { icon: Image, text: "قصور ضخمة مثل كنوسوس، جداريات ملونة تصور الحياة اليومية والمراسم الدينية، معابد صغيرة، عمارة مفتوحة بدون أسوار دفاعية، تصميم داخلي متقدم مع غرف تخزين ومخازن للطعام، نظم الصرف الصحي والمياه متطورة." },
    writing: { icon: Edit3, text: "Linear A، نظام كتابة لم يُفكك رمزه حتى اليوم، استخدم لتسجيل التجارة والطقوس الدينية، كما يظهر تقدم الحضارة في التوثيق الإداري والمالي." },
    fall: { icon: AlertCircle, text: "ثوران بركان سانتوريني تسبب في دمار واسع وأضعف المركز الحضاري، بالإضافة إلى الغزو الميسيني المحتمل والصراعات الداخلية التي أدت لانحدار الحضارة." },
    extra: { icon: Zap, text: "تقدم في صناعة الفخار والمجوهرات وأدوات البرونز، تطور في الملاحة البحرية، استخدام رموز دينية وفنية في الحياة اليومية، تأثير كبير على الحضارات التالية في البحر الأبيض المتوسط، وابتكارات في الزراعة والهندسة المعمارية." },
    image: "/historyMinoan.avif"
};