import { societyDevelopmentPropsI } from "@/interfaces/societyDevelopmentPropsI";

export const societyDevelopment: societyDevelopmentPropsI[] = [
    {
        title: "اللغة والدين",
        text: "كانت اللغة اليونانية القديمة أداة أساسية في توحيد المجتمع ونقل المعرفة والفلسفة والأدب، حيث كُتبت بها الأعمال الكبرى مثل الإلياذة والأوديسة. أما الدين، فكان مرتبطًا بالحياة اليومية ارتباطًا وثيقًا، إذ آمن اليونانيون بالآلهة الأولمبية مثل زيوس وأثينا وأبولو، وكانوا يقيمون الطقوس والاحتفالات والمعابد لإرضائهم وطلب الحماية والرخاء، مما ساهم في ترسيخ القيم الأخلاقية والاجتماعية داخل المجتمع.",
        image: "/ReligionAndLanguage.avif",
        reverse: false
    },
    {
        title: "الاقتصاد",
        text: "اعتمد الاقتصاد اليوناني القديم بشكل رئيسي على الزراعة مثل زراعة الزيتون والعنب والقمح، إلى جانب التجارة البحرية التي ربطت اليونان بالحضارات المجاورة في البحر المتوسط. كما ازدهرت الصناعات الحرفية مثل الفخار وصناعة السفن والمعادن، مما ساعد على خلق فرص عمل وتبادل ثقافي وتجاري ساهم في نمو المدن وتطورها اقتصاديًا.",
        image: "/Economy.avif",
        reverse: true
    },
    {
        title: "البنية التحتية",
        text: "تميّزت المدن اليونانية بتخطيط عمراني متقدم شمل بناء الطرق والموانئ والساحات العامة (الأغورا) والمعابد والمسارح. هذه المنشآت لم تكن فقط لخدمة السكان، بل كانت أيضًا مراكز للنقاش السياسي والثقافي والديني، مما عزز الترابط الاجتماعي وساعد على تطور الحياة المدنية داخل المدن.",
        image: "/Building.avif",
        reverse: false
    },
    {
        title: "التعليم",
        text: "كان التعليم في اليونان القديمة يهدف إلى تكوين الإنسان المتكامل جسديًا وعقليًا وأخلاقيًا، حيث تعلّم الأطفال القراءة والكتابة والموسيقى والرياضة والفلسفة. وقد ساهم فلاسفة مثل سقراط وأفلاطون وأرسطو في تطوير أساليب التفكير النقدي والمنهجي، مما جعل التعليم حجر الأساس في تقدم المجتمع اليوناني وتأثيره على الحضارة الإنسانية لاحقًا.",
        image: "/Learing.avif",
        reverse: true
    },
    {
        title: "العلم والتكنولوجيا",
        text: "قدّم اليونانيون إسهامات عظيمة في مجالات الرياضيات والفلك والطب والهندسة، مثل أعمال فيثاغورس وأرخميدس وهيبوقراط. كما طوروا أدوات وتقنيات هندسية لبناء المعابد والسفن والآلات البسيطة، مما ساعد في تحسين الحياة اليومية وأسهم في انتقال المعرفة العلمية إلى الحضارات التي جاءت بعدهم.",
        image: "/Technology.avif",
        reverse: false
    }
]